exports.search_items_with_flag_9 = {
  searchSpec: {
    itemsType: "avl_unit",
    propName: "sys_name",
    propValueMask: "*",
    sortType: "sys_name",
    propType: "",
    or_logic: "0"
  },
  dataFlags: 9,
  totalItemsCount: 15,
  indexFrom: 0,
  indexTo: 0,
  items: [
    {
      nm: "T 304 KB 178",
      cls: 2,
      id: 25606053,
      mu: 0,
      flds: {
        "1": {
          id: 1,
          n: "grvcard",
          v: "9062",
          ct: 1659144365,
          mt: 1659144365
        },
        "2": {
          id: 2,
          n: "123",
          v: "e",
          ct: 1675851218,
          mt: 1675851218
        }
      },
      fldsmax: 0,
      uacl: 880333094911
    },
    {
      nm: "А 266 ЕТ 147",
      cls: 2,
      id: 25606060,
      mu: 0,
      flds: {
        "1": {
          id: 1,
          n: "grvcard",
          v: "22807",
          ct: 1659143147,
          mt: 1659143147
        }
      },
      fldsmax: 0,
      uacl: 33569377
    },
    {
      nm: "А 440 ОВ 147",
      cls: 2,
      id: 25606076,
      mu: 0,
      flds: {},
      fldsmax: 0,
      uacl: 33569377
    },
    {
      nm: "А 442 АК 147",
      cls: 2,
      id: 25606073,
      mu: 0,
      flds: {
        "1": {
          id: 1,
          n: "grvcard",
          v: "22805",
          ct: 1659143130,
          mt: 1659143130
        }
      },
      fldsmax: 0,
      uacl: 33569377
    },
    {
      nm: "ГАЗель в539ко 750(r)",
      cls: 2,
      id: 25965074,
      mu: 0,
      flds: {
        "1": {
          id: 1,
          n: "rcard",
          v: "7826010104903964",
          ct: 1664544248,
          mt: 1664544248
        }
      },
      fldsmax: 0,
      uacl: 880333094911
    },
    {
      nm: "ГАЗель к111хв 750(r)",
      cls: 2,
      id: 25965070,
      mu: 0,
      flds: {
        "1": {
          id: 1,
          n: "rcard",
          v: "7826010108737772",
          ct: 1664544230,
          mt: 1664544230
        },
        "2": {
          id: 2,
          n: "grvcard",
          v: "1234567",
          ct: 1678190895,
          mt: 1678190895
        }
      },
      fldsmax: 0,
      uacl: 880333094911
    },
    {
      nm: "ГАЗель о796на 190(r)",
      cls: 2,
      id: 25965067,
      mu: 0,
      flds: {
        "1": {
          id: 1,
          n: "rcard",
          v: "7826010104903774",
          ct: 1664544003,
          mt: 1664544003
        }
      },
      fldsmax: 0,
      uacl: 880333094911
    },
    {
      nm: "КамАЗ а971тс 750(r)",
      cls: 2,
      id: 25965065,
      mu: 0,
      flds: {
        "1": {
          id: 1,
          n: "rcard",
          v: "7826010108737806",
          ct: 1664544205,
          mt: 1664544205
        }
      },
      fldsmax: 0,
      uacl: 880333094911
    },
    {
      nm: "КамАЗ х665ео 797(r)",
      cls: 2,
      id: 25965058,
      mu: 0,
      flds: {
        "1": {
          id: 1,
          n: "rcard",
          v: "7826010104903766",
          ct: 1664544187,
          mt: 1664544187
        }
      },
      fldsmax: 0,
      uacl: 880333094911
    },
    {
      nm: "Техники А 481 НС 198",
      cls: 2,
      id: 25763348,
      mu: 0,
      flds: {
        "1": {
          id: 1,
          n: "pprcard",
          v: "3005626872",
          ct: 1660204099,
          mt: 1660204099
        }
      },
      fldsmax: 0,
      uacl: 33569377
    },
    {
      nm: "Техники А 999 СЕ 198",
      cls: 2,
      id: 25763235,
      mu: 0,
      flds: {},
      fldsmax: 0,
      uacl: 33569377
    },
    {
      nm: "Техники В 418 РН 198",
      cls: 2,
      id: 25763238,
      mu: 0,
      flds: {
        "1": {
          id: 1,
          n: "pprcard",
          v: "3005632808",
          ct: 1660203973,
          mt: 1660203973
        }
      },
      fldsmax: 0,
      uacl: 33569377
    },
    {
      nm: "Техники К 523 УЕ198",
      cls: 2,
      id: 25763341,
      mu: 0,
      flds: {
        "1": {
          id: 1,
          n: "pin",
          v: "9852",
          ct: 1658756513,
          mt: 1658756513
        },
        "2": {
          id: 2,
          n: "pprcard",
          v: "3005622408",
          ct: 1660203288,
          mt: 1660203288
        }
      },
      fldsmax: 0,
      uacl: 33569377
    },
    {
      nm: "Техники К 930 ВН 198",
      cls: 2,
      id: 25763244,
      mu: 0,
      flds: {
        "1": {
          id: 1,
          n: "pin",
          v: "8462",
          ct: 1658755107,
          mt: 1658755107
        },
        "2": {
          id: 2,
          n: "pprcard",
          v: "3005710732",
          ct: 1660203189,
          mt: 1660203189
        }
      },
      fldsmax: 0,
      uacl: 880333094911
    },
    {
      nm: "Техники Х 407 РН 178",
      cls: 2,
      id: 25763241,
      mu: 0,
      flds: {
        "1": {
          id: 1,
          n: "pprcard",
          v: "3005817824",
          ct: 1660204243,
          mt: 1660204243
        }
      },
      fldsmax: 0,
      uacl: 880333094911
    }
  ]
};

exports.search_item_with_flag_9 = {
  item: {
    nm: "ГАЗель к111хв 750(r)",
    cls: 2,
    id: 25965070,
    mu: 0,
    flds: {
      "1": {
        id: 1,
        n: "grvcard",
        v: "1234567",
        ct: 1664544230,
        mt: 1664544230
      }
    },
    fldsmax: 0,
    uacl: 880333094911
  },
  flags: 9
};

exports.item_update_custom_field_add = [
  2,
  {
    id: 2,
    n: "rcard",
    v: "7826010108737772",
    ct: 1678195127,
    mt: 1678195127
  }
];

exports.item_update_custom_field_delete = [2, null];

exports.search_items_with_flag_1 = {
  searchSpec: {
    itemsType: "avl_unit_group",
    propName: "sys_name",
    propValueMask: "*",
    sortType: "sys_name",
    propType: "",
    or_logic: "0"
  },
  dataFlags: 1,
  totalItemsCount: 14,
  indexFrom: 0,
  indexTo: 0,
  items: [
    {
      nm: "1659526116901",
      cls: 5,
      id: 25795384,
      mu: 0,
      u: [
        25606053,
        25606060,
        25606073,
        25606076,
        25763235,
        25763238,
        25763241,
        25763244,
        25763341,
        25763348
      ],
      uacl: 880333094911
    },
    {
      nm: "For app Wialon_1",
      cls: 5,
      id: 21319894,
      mu: 0,
      u: [],
      uacl: 880333045759
    },
    {
      nm: "For app Wialon_2",
      cls: 5,
      id: 21387427,
      mu: 0,
      u: [],
      uacl: 880333094911
    },
    {
      nm: "FORKLIFTS",
      cls: 5,
      id: 26063336,
      mu: 0,
      u: [24950136],
      uacl: 880333094911
    },
    {
      nm: "NIMBUS",
      cls: 5,
      id: 24538622,
      mu: 0,
      u: [],
      uacl: 880333094911
    },
    {
      nm: "Группа 3",
      cls: 5,
      id: 25821118,
      mu: 0,
      u: [25821545, 25821553, 25821556],
      uacl: 880333094911
    },
    {
      nm: "Группа 4",
      cls: 5,
      id: 25821054,
      mu: 0,
      u: [25821576, 25821578, 25821579],
      uacl: 880333094911
    },
    {
      nm: "Группа_temp_air",
      cls: 5,
      id: 21819222,
      mu: 0,
      u: [25821497, 25821545, 25821553, 25821579],
      uacl: 880333094911
    },
    {
      nm: "ППР (ГЛОНАСС-Т)",
      cls: 5,
      id: 25763250,
      mu: 0,
      u: [25763235, 25763238, 25763241, 25763244, 25763341, 25763348],
      uacl: 880333094911
    },
    {
      nm: "РОСНЕФТЬ",
      cls: 5,
      id: 25965075,
      mu: 0,
      u: [25965058, 25965065, 25965067, 25965070, 25965074],
      uacl: 880333094911
    },
    {
      nm: "Тестовая группа 1",
      cls: 5,
      id: 25606170,
      mu: 0,
      u: [25606053, 25606060, 25606073, 25606076],
      uacl: 880333094911
    },
    {
      nm: "Тестовая группа 2",
      cls: 5,
      id: 25606172,
      mu: 0,
      u: [25606053, 25606060],
      uacl: 880333094911
    },
    {
      nm: "Тестовая группа 3",
      cls: 5,
      id: 25606174,
      mu: 0,
      u: [25606073, 25606076],
      uacl: 880333094911
    },
    {
      nm: "ТЕСТОВАЯ КВАРТИРА",
      cls: 5,
      id: 24240174,
      mu: 0,
      u: [],
      uacl: 880333094911
    }
  ]
};

exports.messages_load_interval_for_upload = {
  count: 5,
  messages: [
    {
      t: 1677682407,
      f: 1568,
      tp: "evt",
      et:
        "Идентификатор транзакции:6665687960;Номер карты:7826010104903774;Дата и время заправки:2023-03-01T17:53:27;Сумма заправки:1353.65;Количество топлива:28.74; Тип топлива: АИ-92; Цена топлива: 47.1; Точка обслуживания: AZS101356;Адрес точки обслуживания:Россия, Московская область, Рузский район, А108, справа, д. Нестерово; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
      x: 0,
      y: 0,
      rt: 0,
      p: {
        place:
          "Россия, Московская область, Рузский район, А108, справа, д. Нестерово",
        volume: 28.74,
        cost: 1353.65,
        time_diff: 30
      }
    },
    {
      t: 1677844257,
      f: 1568,
      tp: "evt",
      et:
        "Идентификатор транзакции:6704763340;Номер карты:7826010104903774;Дата и время заправки:2023-03-03T14:50:57;Сумма заправки:1758.24;Количество топлива:37.33; Тип топлива: АИ-92; Цена топлива: 47.1; Точка обслуживания: AZS101356;Адрес точки обслуживания:Россия, Московская область, Рузский район, А108, справа, д. Нестерово; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
      x: 0,
      y: 0,
      rt: 0,
      p: {
        place:
          "Россия, Московская область, Рузский район, А108, справа, д. Нестерово",
        volume: 37.33,
        cost: 1758.24,
        time_diff: 30
      }
    },
    {
      t: 1678056860,
      f: 1568,
      tp: "evt",
      et:
        "Идентификатор транзакции:6740650060;Номер карты:7826010104903774;Дата и время заправки:2023-03-06T01:54:20;Сумма заправки:1502.49;Количество топлива:31.9; Тип топлива: АИ-92; Цена топлива: 47.1; Точка обслуживания: AZS101356;Адрес точки обслуживания:Россия, Московская область, Рузский район, А108, справа, д. Нестерово; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
      x: 0,
      y: 0,
      rt: 0,
      p: {
        place:
          "Россия, Московская область, Рузский район, А108, справа, д. Нестерово",
        volume: 31.9,
        cost: 1502.49,
        time_diff: 30
      }
    },
    {
      t: 1678273826,
      f: 1568,
      tp: "evt",
      et:
        "Идентификатор транзакции:6789221290;Номер карты:7826010104903774;Дата и время заправки:2023-03-08T14:10:26;Сумма заправки:1617;Количество топлива:35; Тип топлива: АИ-92; Цена топлива: 46.2; Точка обслуживания: AZS101489;Адрес точки обслуживания:Россия, Московская область, Наро-Фоминский район, А108, 425 км, слева, д. Назарьево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
      x: 0,
      y: 0,
      rt: 0,
      p: {
        place:
          "Россия, Московская область, Наро-Фоминский район, А108, 425 км, слева, д. Назарьево",
        volume: 35,
        cost: 1617,
        time_diff: 30
      }
    },
    {
      t: 1678369540,
      f: 1568,
      tp: "evt",
      et:
        "Идентификатор транзакции:6809987670;Номер карты:7826010104903774;Дата и время заправки:2023-03-09T16:45:40;Сумма заправки:1177.97;Количество топлива:25.01; Тип топлива: АИ-92; Цена топлива: 47.1; Точка обслуживания: AZS101356;Адрес точки обслуживания:Россия, Московская область, Рузский район, А108, справа, д. Нестерово; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
      x: 0,
      y: 0,
      rt: 0,
      p: {
        place:
          "Россия, Московская область, Рузский район, А108, справа, д. Нестерово",
        volume: 25.01,
        cost: 1177.97,
        time_diff: 30
      }
    }
  ]
};

exports.report_update_report_create_flag = [
  7,
  {
    id: 7,
    n: "2. Сводный группа",
    ct: "avl_unit_group",
    c: 7250
  }
];

exports.report_update_report_delete_flag = [7, null];

exports.report_cleanup_result = {
  error: 0
};

exports.report_get_report_data = [
  {
    id: 7,
    n: "2. Сводный группа",
    ct: "avl_unit_group",
    p: '{"descr":"","bind":{"avl_unit_group":[]}}',
    tbl: [
      {
        n: "unit_group_thefts",
        l: "Сливы",
        c: "",
        cl: "",
        cp: "",
        s: '["render_theft_markers"]',
        sl: '["Маркеры сливов"]',
        filter_order: [],
        p: "",
        sch: {
          f1: 0,
          f2: 0,
          t1: 0,
          t2: 0,
          m: 0,
          y: 0,
          w: 0,
          fl: 0
        },
        f: 0
      },
      {
        n: "unit_group_fillings",
        l: "Заправки",
        c: "",
        cl: "",
        cp: "",
        s: '["render_filling_markers"]',
        sl: '["Маркеры заправок"]',
        filter_order: [],
        p: "",
        sch: {
          f1: 0,
          f2: 0,
          t1: 0,
          t2: 0,
          m: 0,
          y: 0,
          w: 0,
          fl: 0
        },
        f: 0
      },
      {
        n: "unit_group_stats",
        l: "Статистика",
        c: "",
        cl: "",
        cp: "",
        s:
          '["address_format","time_format","us_units","skip_empty_rows","exclude_thefts","trips_mileage","precise_calculations"]',
        sl:
          '["Address","Time Format","Measure","Пропускать пустые строки","Исключить сливы из расхода топлива","Считать пробег только по поездкам","Пробег и топливо с точностью до сотых"]',
        filter_order: [],
        p:
          '{"address_format":"1255211008_10_5","time_format":"%Y-%m-%E_%H:%M:%S","us_units":0}',
        sch: {
          f1: 0,
          f2: 0,
          t1: 0,
          t2: 0,
          m: 0,
          y: 0,
          w: 0,
          fl: 0
        },
        f: 0
      },
      {
        n: "unit_group_generic",
        l: "Сводка",
        c:
          '["correct_mileage","in_motion","eh","thefted","filled","fuel_consumption_fls","avg_fuel_consumption_fls","avg_fuel_consumption_rates","user_column"]',
        cl:
          '["Пробег","Время в движении","Моточасы","Слито","Заправлено(ДУТ)","Потрачено","Ср. расход по ДУТ","Ср. расход по нормам","Разница"]',
        cp:
          '[{},{},{},{},{},{},{},{},{"p":"(avg_fuel_consumption_rates) - (avg_fuel_consumption_fls)","m":"л","vt":"0"}]',
        s: "",
        sl: "",
        filter_order: ["base_eh_sensor", "sensor_name", "custom_sensors_col"],
        p:
          '{"grouping":"{\\"type\\":\\"unit\\"}","custom_interval":{"type":0},"duration_format":"1","custom_sensors_col":[""]}',
        sch: {
          f1: 0,
          f2: 0,
          t1: 0,
          t2: 0,
          m: 0,
          y: 0,
          w: 0,
          fl: 0
        },
        f: 4112
      },
      {
        n: "unit_group_fillings",
        l: "Заправки",
        c: '["time_end","location_end","filled","registered","difference"]',
        cl:
          '["Время","Положение","Заправлено(ДУТ)","Заправлено(Карты)","Разница"]',
        cp: "[{},{},{},{},{}]",
        s: "",
        sl: "",
        filter_order: [
          "geozones_ex",
          "fillings",
          "driver",
          "trailer",
          "sensor_name",
          "custom_sensors_col"
        ],
        p: '{"grouping":"{\\"type\\":\\"unit\\"}","custom_sensors_col":[""]}',
        sch: {
          f1: 0,
          f2: 0,
          t1: 0,
          t2: 0,
          m: 0,
          y: 0,
          w: 0,
          fl: 0
        },
        f: 4368
      },
      {
        n: "unit_group_events",
        l: "События",
        c: '["time","evt_text","evt_type","events_count"]',
        cl: '["Время события","Текст события","Тип события","Кол-во"]',
        cp: "[{},{},{},{}]",
        s: "",
        sl: "",
        filter_order: ["event_mask", "driver"],
        p: '{"grouping":"{\\"type\\":\\"unit\\"}","event_mask":"*транзакц*"}',
        sch: {
          f1: 0,
          f2: 0,
          t1: 0,
          t2: 0,
          m: 0,
          y: 0,
          w: 0,
          fl: 0
        },
        f: 4352
      }
    ],
    bsfl: {
      ct: 1679054211,
      mt: 1679054211
    }
  }
];

exports.report_exect_report = {
  reportResult: {
    msgsRendered: 0,
    stats: [],
    tables: [
      {
        name: "unit_group_generic",
        label: "Сводка",
        grouping: {
          type: "unit"
        },
        flags: 16781328,
        rows: 5,
        level: 1,
        columns: 11,
        header: [
          "№",
          "Группировка",
          "Пробег",
          "Время в движении",
          "Моточасы",
          "Слито",
          "Заправлено(ДУТ)",
          "Потрачено",
          "Ср. расход по ДУТ",
          "Ср. расход по нормам",
          "Разница"
        ],
        header_type: [
          "",
          "",
          "correct_mileage",
          "in_motion",
          "eh",
          "thefted",
          "filled",
          "fuel_consumption_fls",
          "avg_fuel_consumption_fls",
          "avg_fuel_consumption_rates",
          "user_column"
        ],
        total: [
          "",
          "Итого",
          "7443.81 км",
          "291:15:09",
          "463:36:01",
          "39.21 л",
          "2433.62 л",
          "2344.80 л",
          "31.43 л/100 км",
          "21.55 л/100 км",
          "-9.87 л"
        ],
        totalRaw: [
          {
            v: 0,
            vt: 0
          },
          {
            v: 0,
            vt: 0
          },
          {
            v: 7443807.28817,
            vt: 10
          },
          {
            v: 1048509,
            vt: 41
          },
          {
            v: 1668961,
            vt: 41
          },
          {
            v: 39.2107468843,
            vt: 50
          },
          {
            v: 2433.62159681,
            vt: 50
          },
          {
            v: 2344.80356156,
            vt: 50
          },
          {
            v: 31.4251978759,
            vt: 51
          },
          {
            v: 21.5544537309,
            vt: 51
          },
          {
            v: 0,
            vt: 114
          }
        ]
      },
      {
        name: "unit_group_fillings",
        label: "Заправки",
        grouping: {
          type: "unit"
        },
        flags: 16781584,
        rows: 5,
        level: 2,
        columns: 7,
        header: [
          "№",
          "Группировка",
          "Время",
          "Положение",
          "Заправлено(ДУТ)",
          "Заправлено(Карты)",
          "Разница"
        ],
        header_type: [
          "",
          "",
          "time_end",
          "location_end",
          "filled",
          "registered",
          "difference"
        ],
        total: ["", "Итого", "", "", "2433.62 л", "2576.35 л", "-142.73 л"],
        totalRaw: [
          {
            v: 0,
            vt: 0
          },
          {
            v: 0,
            vt: 0
          },
          {
            v: -348201.3876,
            vt: 0
          },
          {
            v: -348201.3876,
            vt: 0
          },
          {
            v: 2433.62159681,
            vt: 50
          },
          {
            v: 2576.35,
            vt: 50
          },
          {
            v: -142.728403193,
            vt: 54
          }
        ]
      },
      {
        name: "unit_group_events",
        label: "События",
        grouping: {
          type: "unit"
        },
        flags: 16781568,
        rows: 5,
        level: 2,
        columns: 6,
        header: [
          "№",
          "Группировка",
          "Время события",
          "Текст события",
          "Тип события",
          "Кол-во"
        ],
        header_type: ["", "", "time", "evt_text", "evt_type", "events_count"]
      }
    ],
    attachments: []
  },
  reportLayer: {
    name: "report markers",
    bounds: [55.1754302823, 36.2046916667, 55.9712533271, 36.8876266146]
  },
  layerCount: 1
};

exports.report_select_result_rows_table_index_0 = [
  {
    n: 0,
    i1: 0,
    i2: 25476,
    t1: 1677628871,
    t2: 1678972495,
    d: 0,
    uid: 25965074,
    c: [
      "1",
      "ГАЗель в539ко 750(r)",
      "1327.56 км",
      "47:13:09",
      "65:37:48",
      "34.71 л",
      "123.34 л",
      "121.89 л",
      "9.17 л/100 км",
      "15.00 л/100 км",
      "5.83 л"
    ]
  },
  {
    n: 1,
    i1: 0,
    i2: 30338,
    t1: 1677628919,
    t2: 1679058310,
    d: 0,
    uid: 25965070,
    c: [
      "2",
      "ГАЗель к111хв 750(r)",
      "2292.31 км",
      "89:01:08",
      "140:11:49",
      "0.00 л",
      "532.53 л",
      "541.87 л",
      "23.56 л/100 км",
      "15.00 л/100 км",
      "-8.56 л"
    ]
  },
  {
    n: 2,
    i1: 0,
    i2: 18351,
    t1: 1677629107,
    t2: 1679058123,
    d: 0,
    uid: 25965067,
    c: [
      "3",
      "ГАЗель о796на 190(r)",
      "1386.36 км",
      "64:57:44",
      "78:29:27",
      "0.00 л",
      "315.06 л",
      "324.41 л",
      "23.30 л/100 км",
      "15.00 л/100 км",
      "-8.30 л"
    ]
  },
  {
    n: 3,
    i1: 0,
    i2: 14973,
    t1: 1677628803,
    t2: 1679057629,
    d: 0,
    uid: 25965065,
    c: [
      "4",
      "КамАЗ а971тс 750(r)",
      "573.69 км",
      "29:12:43",
      "60:31:49",
      "0.00 л",
      "464.98 л",
      "445.27 л",
      "77.23 л/100 км",
      "35.00 л/100 км",
      "-42.23 л"
    ]
  },
  {
    n: 4,
    i1: 0,
    i2: 20693,
    t1: 1677628891,
    t2: 1679058077,
    d: 0,
    uid: 25965058,
    c: [
      "5",
      "КамАЗ х665ео 797(r)",
      "1868.65 км",
      "61:11:40",
      "119:07:35",
      "4.50 л",
      "997.71 л",
      "911.23 л",
      "48.76 л/100 км",
      "35.00 л/100 км",
      "-13.76 л"
    ]
  }
];
exports.report_select_result_rows_table_index_1 = [
  {
    n: 0,
    i1: 846,
    i2: 20878,
    t1: 1677655702,
    t2: 1678452674,
    d: 9,
    uid: 25965074,
    c: [
      "1",
      "ГАЗель в539ко 750(r)",
      "2023-03-10 15:51:14",
      {
        t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
        y: 55.7476043691,
        x: 36.8876647942,
        u: 25965074
      },
      "123.34 л",
      "288.34 л",
      "-165.00 л"
    ],
    r: [
      {
        n: 0,
        i1: 846,
        i2: 851,
        t1: 1677655702,
        t2: 1677655777,
        d: 0,
        uid: 25965074,
        c: [
          "1.1",
          "ГАЗель в539ко 750(r)",
          {
            t: "2023-03-01 10:29:37",
            v: 1677655777,
            y: 55.747558583,
            x: 36.8876189871,
            u: 25965074
          },
          {
            t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
            y: 55.747558583,
            x: 36.8876189871,
            u: 25965074
          },
          "30.93 л",
          "35.00 л",
          "-4.07 л"
        ]
      },
      {
        n: 1,
        i1: 4456,
        i2: 4487,
        t1: 1677746024,
        t2: 1677746583,
        d: 0,
        uid: 25965074,
        c: [
          "1.2",
          "ГАЗель в539ко 750(r)",
          {
            t: "2023-03-02 11:43:03",
            v: 1677746583,
            y: 55.747623438,
            x: 36.8876266146,
            u: 25965074
          },
          {
            t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
            y: 55.747623438,
            x: 36.8876266146,
            u: 25965074
          },
          "46.88 л",
          "50.00 л",
          "-3.12 л"
        ]
      },
      {
        n: 2,
        i1: 6656,
        i2: 6674,
        t1: 1677835763,
        t2: 1677835900,
        d: 0,
        uid: 25965074,
        c: [
          "1.3",
          "ГАЗель в539ко 750(r)",
          {
            t: "2023-03-03 12:31:40",
            v: 1677835900,
            y: 55.7017593192,
            x: 36.8819350928,
            u: 25965074
          },
          {
            t: "А-107, Звенигород, Московская обл., Россия",
            y: 55.7017593192,
            x: 36.8819350928,
            u: 25965074
          },
          "45.53 л",
          "-----",
          "45.53 л"
        ]
      },
      {
        n: 3,
        i1: 6995,
        i2: 6995,
        t1: 1677841274,
        t2: 1677841274,
        d: 0,
        uid: 25965074,
        c: [
          "1.4",
          "ГАЗель в539ко 750(r)",
          "2023-03-03 14:01:14",
          {
            t:
              "«московское Малое Кольцо», Большие Вязёмы, Московская обл., Россия",
            y: 55.6319427387,
            x: 36.9830817815,
            u: 25965074
          },
          "-----",
          "33.28 л",
          "-33.28 л"
        ]
      },
      {
        n: 4,
        i1: 10066,
        i2: 10066,
        t1: 1678018600,
        t2: 1678018600,
        d: 0,
        uid: 25965074,
        c: [
          "1.5",
          "ГАЗель в539ко 750(r)",
          "2023-03-05 15:16:40",
          {
            t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
            y: 55.7475280729,
            x: 36.8874892771,
            u: 25965074
          },
          "-----",
          "38.06 л",
          "-38.06 л"
        ]
      },
      {
        n: 5,
        i1: 12380,
        i2: 12380,
        t1: 1678102981,
        t2: 1678102981,
        d: 0,
        uid: 25965074,
        c: [
          "1.6",
          "ГАЗель в539ко 750(r)",
          "2023-03-06 14:43:01",
          {
            t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
            y: 55.7476043691,
            x: 36.8874320707,
            u: 25965074
          },
          "-----",
          "30.00 л",
          "-30.00 л"
        ]
      },
      {
        n: 6,
        i1: 14836,
        i2: 14836,
        t1: 1678196368,
        t2: 1678196368,
        d: 0,
        uid: 25965074,
        c: [
          "1.7",
          "ГАЗель в539ко 750(r)",
          "2023-03-07 16:39:28",
          {
            t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
            y: 55.7475890931,
            x: 36.887683863,
            u: 25965074
          },
          "-----",
          "36.00 л",
          "-36.00 л"
        ]
      },
      {
        n: 7,
        i1: 17786,
        i2: 17786,
        t1: 1678341902,
        t2: 1678341902,
        d: 0,
        uid: 25965074,
        c: [
          "1.8",
          "ГАЗель в539ко 750(r)",
          "2023-03-09 09:05:02",
          {
            t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
            y: 55.7475700243,
            x: 36.8877067456,
            u: 25965074
          },
          "-----",
          "36.00 л",
          "-36.00 л"
        ]
      },
      {
        n: 8,
        i1: 20878,
        i2: 20878,
        t1: 1678452674,
        t2: 1678452674,
        d: 0,
        uid: 25965074,
        c: [
          "1.9",
          "ГАЗель в539ко 750(r)",
          "2023-03-10 15:51:14",
          {
            t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
            y: 55.7476043691,
            x: 36.8876647942,
            u: 25965074
          },
          "-----",
          "30.00 л",
          "-30.00 л"
        ]
      }
    ]
  },
  {
    n: 1,
    i1: 2137,
    i2: 28831,
    t1: 1677680433,
    t2: 1678964692,
    d: 13,
    uid: 25965070,
    c: [
      "2",
      "ГАЗель к111хв 750(r)",
      {
        t: "2023-03-16 14:04:52",
        v: 1678964692,
        y: 55.1754569996,
        x: 36.6746940456,
        u: 25965070
      },
      {
        t: "Киевское шоссе, Балабаново, Калужская обл., Россия",
        y: 55.1754569996,
        x: 36.6746940456,
        u: 25965070
      },
      "532.53 л",
      "530.55 л",
      "1.98 л"
    ],
    r: [
      {
        n: 0,
        i1: 2137,
        i2: 2165,
        t1: 1677680433,
        t2: 1677681226,
        d: 0,
        uid: 25965070,
        c: [
          "2.1",
          "ГАЗель к111хв 750(r)",
          {
            t: "2023-03-01 17:33:46",
            v: 1677681226,
            y: 55.1754569996,
            x: 36.6745109429,
            u: 25965070
          },
          {
            t: "Киевское шоссе, Балабаново, Калужская обл., Россия",
            y: 55.1754569996,
            x: 36.6745109429,
            u: 25965070
          },
          "50.68 л",
          "48.05 л",
          "2.63 л"
        ]
      },
      {
        n: 1,
        i1: 4336,
        i2: 4345,
        t1: 1677749550,
        t2: 1677749727,
        d: 0,
        uid: 25965070,
        c: [
          "2.2",
          "ГАЗель к111хв 750(r)",
          {
            t: "2023-03-02 12:35:27",
            v: 1677749727,
            y: 55.1754302823,
            x: 36.6745300118,
            u: 25965070
          },
          {
            t: "Киевское шоссе, Балабаново, Калужская обл., Россия",
            y: 55.1754302823,
            x: 36.6745300118,
            u: 25965070
          },
          "41.43 л",
          "40.55 л",
          "0.88 л"
        ]
      },
      {
        n: 2,
        i1: 6542,
        i2: 6545,
        t1: 1677842872,
        t2: 1677842947,
        d: 0,
        uid: 25965070,
        c: [
          "2.3",
          "ГАЗель к111хв 750(r)",
          {
            t: "2023-03-03 14:29:07",
            v: 1677842947,
            y: 55.1754684409,
            x: 36.6746940456,
            u: 25965070
          },
          {
            t: "Киевское шоссе, Балабаново, Калужская обл., Россия",
            y: 55.1754684409,
            x: 36.6746940456,
            u: 25965070
          },
          "40.94 л",
          "40.00 л",
          "0.94 л"
        ]
      },
      {
        n: 3,
        i1: 9221,
        i2: 9225,
        t1: 1678040883,
        t2: 1678041023,
        d: 0,
        uid: 25965070,
        c: [
          "2.4",
          "ГАЗель к111хв 750(r)",
          {
            t: "2023-03-05 21:30:23",
            v: 1678041023,
            y: 55.1754684409,
            x: 36.6746520942,
            u: 25965070
          },
          {
            t: "Киевское шоссе, Балабаново, Калужская обл., Россия",
            y: 55.1754684409,
            x: 36.6746520942,
            u: 25965070
          },
          "41.83 л",
          "41.65 л",
          "0.18 л"
        ]
      },
      {
        n: 4,
        i1: 11145,
        i2: 11161,
        t1: 1678187167,
        t2: 1678187373,
        d: 0,
        uid: 25965070,
        c: [
          "2.5",
          "ГАЗель к111хв 750(r)",
          {
            t: "2023-03-07 14:09:33",
            v: 1678187373,
            y: 55.1754875097,
            x: 36.6746749768,
            u: 25965070
          },
          {
            t: "Киевское шоссе, Балабаново, Калужская обл., Россия",
            y: 55.1754875097,
            x: 36.6746749768,
            u: 25965070
          },
          "31.50 л",
          "31.00 л",
          "0.50 л"
        ]
      },
      {
        n: 5,
        i1: 13236,
        i2: 13239,
        t1: 1678278078,
        t2: 1678278142,
        d: 0,
        uid: 25965070,
        c: [
          "2.6",
          "ГАЗель к111хв 750(r)",
          {
            t: "2023-03-08 15:22:22",
            v: 1678278142,
            y: 55.1754302823,
            x: 36.6747054869,
            u: 25965070
          },
          {
            t: "Киевское шоссе, Балабаново, Калужская обл., Россия",
            y: 55.1754302823,
            x: 36.6747054869,
            u: 25965070
          },
          "36.97 л",
          "40.80 л",
          "-3.83 л"
        ]
      },
      {
        n: 6,
        i1: 15356,
        i2: 15361,
        t1: 1678361049,
        t2: 1678361188,
        d: 0,
        uid: 25965070,
        c: [
          "2.7",
          "ГАЗель к111хв 750(r)",
          {
            t: "2023-03-09 14:26:28",
            v: 1678361188,
            y: 55.384052269,
            x: 36.3963890021,
            u: 25965070
          },
          {
            t: "46К-3130, Московская обл., Россия, 1.44 км от Назарьево",
            y: 55.384052269,
            x: 36.3963890021,
            u: 25965070
          },
          "37.74 л",
          "40.00 л",
          "-2.26 л"
        ]
      },
      {
        n: 7,
        i1: 17452,
        i2: 17457,
        t1: 1678461043,
        t2: 1678461097,
        d: 0,
        uid: 25965070,
        c: [
          "2.8",
          "ГАЗель к111хв 750(r)",
          {
            t: "2023-03-10 18:11:37",
            v: 1678461097,
            y: 55.3840179242,
            x: 36.3964271397,
            u: 25965070
          },
          {
            t: "46К-3130, Московская обл., Россия, 1.43 км от Назарьево",
            y: 55.3840179242,
            x: 36.3964271397,
            u: 25965070
          },
          "41.49 л",
          "42.00 л",
          "-0.51 л"
        ]
      },
      {
        n: 8,
        i1: 19508,
        i2: 19512,
        t1: 1678566651,
        t2: 1678566781,
        d: 0,
        uid: 25965070,
        c: [
          "2.9",
          "ГАЗель к111хв 750(r)",
          {
            t: "2023-03-11 23:33:01",
            v: 1678566781,
            y: 55.1754608134,
            x: 36.6745948458,
            u: 25965070
          },
          {
            t: "Киевское шоссе, Балабаново, Калужская обл., Россия",
            y: 55.1754608134,
            x: 36.6745948458,
            u: 25965070
          },
          "38.23 л",
          "38.30 л",
          "-0.07 л"
        ]
      },
      {
        n: 9,
        i1: 22294,
        i2: 22330,
        t1: 1678725114,
        t2: 1678725906,
        d: 0,
        uid: 25965070,
        c: [
          "2.10",
          "ГАЗель к111хв 750(r)",
          {
            t: "2023-03-13 19:45:06",
            v: 1678725906,
            y: 55.1754569996,
            x: 36.6745681494,
            u: 25965070
          },
          {
            t: "Киевское шоссе, Балабаново, Калужская обл., Россия",
            y: 55.1754569996,
            x: 36.6745681494,
            u: 25965070
          },
          "60.70 л",
          "57.15 л",
          "3.55 л"
        ]
      },
      {
        n: 10,
        i1: 24344,
        i2: 24349,
        t1: 1678812414,
        t2: 1678812542,
        d: 0,
        uid: 25965070,
        c: [
          "2.11",
          "ГАЗель к111хв 750(r)",
          {
            t: "2023-03-14 19:49:02",
            v: 1678812542,
            y: 55.1754798822,
            x: 36.6745528944,
            u: 25965070
          },
          {
            t: "Киевское шоссе, Балабаново, Калужская обл., Россия",
            y: 55.1754798822,
            x: 36.6745528944,
            u: 25965070
          },
          "36.52 л",
          "36.30 л",
          "0.22 л"
        ]
      },
      {
        n: 11,
        i1: 26790,
        i2: 26798,
        t1: 1678891988,
        t2: 1678892149,
        d: 0,
        uid: 25965070,
        c: [
          "2.12",
          "ГАЗель к111хв 750(r)",
          {
            t: "2023-03-15 17:55:49",
            v: 1678892149,
            y: 55.3840332002,
            x: 36.3964042571,
            u: 25965070
          },
          {
            t: "46К-3130, Московская обл., Россия, 1.44 км от Назарьево",
            y: 55.3840332002,
            x: 36.3964042571,
            u: 25965070
          },
          "42.80 л",
          "43.00 л",
          "-0.20 л"
        ]
      },
      {
        n: 12,
        i1: 28824,
        i2: 28831,
        t1: 1678964485,
        t2: 1678964692,
        d: 0,
        uid: 25965070,
        c: [
          "2.13",
          "ГАЗель к111хв 750(r)",
          {
            t: "2023-03-16 14:04:52",
            v: 1678964692,
            y: 55.1754569996,
            x: 36.6746940456,
            u: 25965070
          },
          {
            t: "Киевское шоссе, Балабаново, Калужская обл., Россия",
            y: 55.1754569996,
            x: 36.6746940456,
            u: 25965070
          },
          "31.70 л",
          "31.75 л",
          "-0.05 л"
        ]
      }
    ]
  },
  {
    n: 2,
    i1: 1200,
    i2: 17221,
    t1: 1677682247,
    t2: 1678977470,
    d: 9,
    uid: 25965067,
    c: [
      "3",
      "ГАЗель о796на 190(r)",
      {
        t: "2023-03-16 17:37:50",
        v: 1678977470,
        y: 55.7097116667,
        x: 36.2047816667,
        u: 25965067
      },
      {
        t: "А-108, Руза, Московская обл., Россия",
        y: 55.7097116667,
        x: 36.2047816667,
        u: 25965067
      },
      "315.06 л",
      "316.06 л",
      "-1.00 л"
    ],
    r: [
      {
        n: 0,
        i1: 1200,
        i2: 1213,
        t1: 1677682247,
        t2: 1677682338,
        d: 0,
        uid: 25965067,
        c: [
          "3.1",
          "ГАЗель о796на 190(r)",
          {
            t: "2023-03-01 17:52:18",
            v: 1677682338,
            y: 55.6251366667,
            x: 36.3436433333,
            u: 25965067
          },
          {
            t: "46К-1152, Московская обл., Россия, Нестерово",
            y: 55.6251366667,
            x: 36.3436433333,
            u: 25965067
          },
          "29.24 л",
          "28.74 л",
          "0.50 л"
        ]
      },
      {
        n: 1,
        i1: 3204,
        i2: 3226,
        t1: 1677843928,
        t2: 1677844184,
        d: 0,
        uid: 25965067,
        c: [
          "3.2",
          "ГАЗель о796на 190(r)",
          {
            t: "2023-03-03 14:49:44",
            v: 1677844184,
            y: 55.6252033333,
            x: 36.3436616667,
            u: 25965067
          },
          {
            t: "46К-1152, Московская обл., Россия, Нестерово",
            y: 55.6252033333,
            x: 36.3436616667,
            u: 25965067
          },
          "37.61 л",
          "37.33 л",
          "0.28 л"
        ]
      },
      {
        n: 2,
        i1: 5159,
        i2: 5167,
        t1: 1678056677,
        t2: 1678056744,
        d: 0,
        uid: 25965067,
        c: [
          "3.3",
          "ГАЗель о796на 190(r)",
          {
            t: "2023-03-06 01:52:24",
            v: 1678056744,
            y: 55.6250816667,
            x: 36.3435866667,
            u: 25965067
          },
          {
            t: "46К-1152, Московская обл., Россия, Нестерово",
            y: 55.6250816667,
            x: 36.3435866667,
            u: 25965067
          },
          "30.12 л",
          "31.90 л",
          "-1.78 л"
        ]
      },
      {
        n: 3,
        i1: 7523,
        i2: 7550,
        t1: 1678273577,
        t2: 1678273912,
        d: 0,
        uid: 25965067,
        c: [
          "3.4",
          "ГАЗель о796на 190(r)",
          {
            t: "2023-03-08 14:11:52",
            v: 1678273912,
            y: 55.384075,
            x: 36.3965183333,
            u: 25965067
          },
          {
            t: "46К-3130, Московская обл., Россия, 1.44 км от Назарьево",
            y: 55.384075,
            x: 36.3965183333,
            u: 25965067
          },
          "34.86 л",
          "35.00 л",
          "-0.14 л"
        ]
      },
      {
        n: 4,
        i1: 8911,
        i2: 8921,
        t1: 1678369388,
        t2: 1678369463,
        d: 0,
        uid: 25965067,
        c: [
          "3.5",
          "ГАЗель о796на 190(r)",
          {
            t: "2023-03-09 16:44:23",
            v: 1678369463,
            y: 55.62528,
            x: 36.34377,
            u: 25965067
          },
          {
            t: "46Н-10154, Московская обл., Россия, Нестерово",
            y: 55.62528,
            x: 36.34377,
            u: 25965067
          },
          "24.85 л",
          "25.01 л",
          "-0.16 л"
        ]
      },
      {
        n: 5,
        i1: 10125,
        i2: 10142,
        t1: 1678454560,
        t2: 1678454789,
        d: 0,
        uid: 25965067,
        c: [
          "3.6",
          "ГАЗель о796на 190(r)",
          {
            t: "2023-03-10 16:26:29",
            v: 1678454789,
            y: 55.6251633333,
            x: 36.3436966667,
            u: 25965067
          },
          {
            t: "46К-1152, Московская обл., Россия, Нестерово",
            y: 55.6251633333,
            x: 36.3436966667,
            u: 25965067
          },
          "27.05 л",
          "26.64 л",
          "0.41 л"
        ]
      },
      {
        n: 6,
        i1: 12306,
        i2: 12329,
        t1: 1678620582,
        t2: 1678620692,
        d: 0,
        uid: 25965067,
        c: [
          "3.7",
          "ГАЗель о796на 190(r)",
          {
            t: "2023-03-12 14:31:32",
            v: 1678620692,
            y: 55.7097216667,
            x: 36.2046916667,
            u: 25965067
          },
          {
            t: "А-108, Руза, Московская обл., Россия",
            y: 55.7097216667,
            x: 36.2046916667,
            u: 25965067
          },
          "41.97 л",
          "42.73 л",
          "-0.76 л"
        ]
      },
      {
        n: 7,
        i1: 14692,
        i2: 14702,
        t1: 1678743115,
        t2: 1678743211,
        d: 0,
        uid: 25965067,
        c: [
          "3.8",
          "ГАЗель о796на 190(r)",
          {
            t: "2023-03-14 00:33:31",
            v: 1678743211,
            y: 55.6251,
            x: 36.3436066667,
            u: 25965067
          },
          {
            t: "46К-1152, Московская обл., Россия, Нестерово",
            y: 55.6251,
            x: 36.3436066667,
            u: 25965067
          },
          "49.21 л",
          "48.71 л",
          "0.50 л"
        ]
      },
      {
        n: 8,
        i1: 17211,
        i2: 17221,
        t1: 1678977300,
        t2: 1678977470,
        d: 0,
        uid: 25965067,
        c: [
          "3.9",
          "ГАЗель о796на 190(r)",
          {
            t: "2023-03-16 17:37:50",
            v: 1678977470,
            y: 55.7097116667,
            x: 36.2047816667,
            u: 25965067
          },
          {
            t: "А-108, Руза, Московская обл., Россия",
            y: 55.7097116667,
            x: 36.2047816667,
            u: 25965067
          },
          "40.15 л",
          "40.00 л",
          "0.15 л"
        ]
      }
    ]
  },
  {
    n: 3,
    i1: 8328,
    i2: 12954,
    t1: 1678569460,
    t2: 1678777997,
    d: 2,
    uid: 25965065,
    c: [
      "4",
      "КамАЗ а971тс 750(r)",
      {
        t: "2023-03-14 10:13:17",
        v: 1678777997,
        y: 55.7475013555,
        x: 36.887104003,
        u: 25965065
      },
      {
        t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
        y: 55.7475013555,
        x: 36.887104003,
        u: 25965065
      },
      "464.98 л",
      "465.96 л",
      "-0.98 л"
    ],
    r: [
      {
        n: 0,
        i1: 8328,
        i2: 8328,
        t1: 1678569460,
        t2: 1678569460,
        d: 0,
        uid: 25965065,
        c: [
          "4.1",
          "КамАЗ а971тс 750(r)",
          {
            t: "2023-03-12 00:17:40",
            v: 1678569460,
            y: 55.7475280729,
            x: 36.8871459544,
            u: 25965065
          },
          {
            t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
            y: 55.7475280729,
            x: 36.8871459544,
            u: 25965065
          },
          "242.99 л",
          "243.72 л",
          "-0.73 л"
        ]
      },
      {
        n: 1,
        i1: 12949,
        i2: 12954,
        t1: 1678777830,
        t2: 1678777997,
        d: 0,
        uid: 25965065,
        c: [
          "4.2",
          "КамАЗ а971тс 750(r)",
          {
            t: "2023-03-14 10:13:17",
            v: 1678777997,
            y: 55.7475013555,
            x: 36.887104003,
            u: 25965065
          },
          {
            t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
            y: 55.7475013555,
            x: 36.887104003,
            u: 25965065
          },
          "222.00 л",
          "222.24 л",
          "-0.24 л"
        ]
      }
    ]
  },
  {
    n: 4,
    i1: 151,
    i2: 18615,
    t1: 1677645930,
    t2: 1678943902,
    d: 6,
    uid: 25965058,
    c: [
      "5",
      "КамАЗ х665ео 797(r)",
      {
        t: "2023-03-16 08:18:22",
        v: 1678943902,
        y: 55.7475799987,
        x: 36.8872733174,
        u: 25965058
      },
      {
        t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
        y: 55.7475799987,
        x: 36.8872733174,
        u: 25965058
      },
      "997.71 л",
      "975.44 л",
      "22.27 л"
    ],
    r: [
      {
        n: 0,
        i1: 151,
        i2: 160,
        t1: 1677645930,
        t2: 1677646615,
        d: 0,
        uid: 25965058,
        c: [
          "5.1",
          "КамАЗ х665ео 797(r)",
          {
            t: "2023-03-01 07:56:55",
            v: 1677646615,
            y: 55.7475033253,
            x: 36.8873716371,
            u: 25965058
          },
          {
            t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
            y: 55.7475033253,
            x: 36.8873716371,
            u: 25965058
          },
          "188.50 л",
          "184.37 л",
          "4.13 л"
        ]
      },
      {
        n: 1,
        i1: 3815,
        i2: 3820,
        t1: 1677789114,
        t2: 1677789188,
        d: 0,
        uid: 25965058,
        c: [
          "5.2",
          "КамАЗ х665ео 797(r)",
          {
            t: "2023-03-02 23:33:08",
            v: 1677789188,
            y: 55.7081799828,
            x: 36.6686483046,
            u: 25965058
          },
          {
            t: "46К-1151, Московская обл., Россия, 1.05 км от Дьяконово",
            y: 55.7081799828,
            x: 36.6686483046,
            u: 25965058
          },
          "191.71 л",
          "190.00 л",
          "1.71 л"
        ]
      },
      {
        n: 2,
        i1: 8905,
        i2: 8908,
        t1: 1678454038,
        t2: 1678454642,
        d: 0,
        uid: 25965058,
        c: [
          "5.3",
          "КамАЗ х665ео 797(r)",
          {
            t: "2023-03-10 16:24:02",
            v: 1678454642,
            y: 55.9712533271,
            x: 36.5427116343,
            u: 25965058
          },
          {
            t: "Волоколамское шоссе, Румянцево, Московская обл., Россия",
            y: 55.9712533271,
            x: 36.5427116343,
            u: 25965058
          },
          "174.88 л",
          "173.14 л",
          "1.74 л"
        ]
      },
      {
        n: 3,
        i1: 11196,
        i2: 11199,
        t1: 1678596411,
        t2: 1678596477,
        d: 0,
        uid: 25965058,
        c: [
          "5.4",
          "КамАЗ х665ео 797(r)",
          {
            t: "2023-03-12 07:47:57",
            v: 1678596477,
            y: 55.7475216607,
            x: 36.8873666499,
            u: 25965058
          },
          {
            t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
            y: 55.7475216607,
            x: 36.8873666499,
            u: 25965058
          },
          "129.54 л",
          "126.00 л",
          "3.54 л"
        ]
      },
      {
        n: 4,
        i1: 15863,
        i2: 15864,
        t1: 1678777469,
        t2: 1678777769,
        d: 0,
        uid: 25965058,
        c: [
          "5.5",
          "КамАЗ х665ео 797(r)",
          {
            t: "2023-03-14 10:09:29",
            v: 1678777769,
            y: 55.7474849899,
            x: 36.8873366427,
            u: 25965058
          },
          {
            t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
            y: 55.7474849899,
            x: 36.8873366427,
            u: 25965058
          },
          "158.17 л",
          "153.93 л",
          "4.24 л"
        ]
      },
      {
        n: 5,
        i1: 18598,
        i2: 18615,
        t1: 1678943746,
        t2: 1678943902,
        d: 0,
        uid: 25965058,
        c: [
          "5.6",
          "КамАЗ х665ео 797(r)",
          {
            t: "2023-03-16 08:18:22",
            v: 1678943902,
            y: 55.7475799987,
            x: 36.8872733174,
            u: 25965058
          },
          {
            t: "Ильинское шоссе, Звенигород, Московская обл., Россия",
            y: 55.7475799987,
            x: 36.8872733174,
            u: 25965058
          },
          "154.90 л",
          "148.00 л",
          "6.90 л"
        ]
      }
    ]
  }
];

exports.report_select_result_rows_table_index_2 = [
  {
    n: 0,
    i1: 0,
    i2: 8,
    t1: 1677655915,
    t2: 1678452674,
    d: 9,
    uid: 25965074,
    c: ["1", "ГАЗель в539ко 750(r)", "2023-03-01 10:31:55", "", "", "9"],
    r: [
      {
        n: 0,
        i1: 0,
        i2: 0,
        t1: 1677655915,
        t2: 1677655915,
        d: 0,
        uid: 25965074,
        c: [
          "1.1",
          "ГАЗель в539ко 750(r)",
          "2023-03-01 10:31:55",
          "Идентификатор транзакции:6656684650;Номер карты:7826010104903964;Дата и время заправки:2023-03-01T10:31:55;Сумма заправки:1666;Количество топлива:35; Тип топлива: АИ-92; Цена топлива: 47.6; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 1,
        i1: 1,
        i2: 1,
        t1: 1677746679,
        t2: 1677746679,
        d: 0,
        uid: 25965074,
        c: [
          "1.2",
          "ГАЗель в539ко 750(r)",
          "2023-03-02 11:44:39",
          "Идентификатор транзакции:6679776040;Номер карты:7826010104903964;Дата и время заправки:2023-03-02T11:44:39;Сумма заправки:2380;Количество топлива:50; Тип топлива: АИ-92; Цена топлива: 47.6; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 2,
        i1: 2,
        i2: 2,
        t1: 1677841274,
        t2: 1677841274,
        d: 0,
        uid: 25965074,
        c: [
          "1.3",
          "ГАЗель в539ко 750(r)",
          "2023-03-03 14:01:14",
          "Идентификатор транзакции:6703729430;Номер карты:7826010104903964;Дата и время заправки:2023-03-03T14:01:14;Сумма заправки:2088;Количество топлива:45; Тип топлива: АИ-92; Цена топлива: 46.4; Точка обслуживания: AZS105280;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, рп. Большие Вязёмы, ш. Звенигородское, 2/1; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 3,
        i1: 3,
        i2: 3,
        t1: 1677841793,
        t2: 1677841793,
        d: 0,
        uid: 25965074,
        c: [
          "1.4",
          "ГАЗель в539ко 750(r)",
          "2023-03-03 14:09:53",
          "Идентификатор транзакции:6703906860;Номер карты:7826010104903964;Дата и время заправки:2023-03-03T14:09:53;Сумма заправки:543.81;Количество топлива:11.72; Тип топлива: АИ-92; Цена топлива: 46.4; Точка обслуживания: AZS105280;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, рп. Большие Вязёмы, ш. Звенигородское, 2/1; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 4,
        i1: 4,
        i2: 4,
        t1: 1678018600,
        t2: 1678018600,
        d: 0,
        uid: 25965074,
        c: [
          "1.5",
          "ГАЗель в539ко 750(r)",
          "2023-03-05 15:16:40",
          "Идентификатор транзакции:6735099860;Номер карты:7826010104903964;Дата и время заправки:2023-03-05T15:16:40;Сумма заправки:1811.66;Количество топлива:38.06; Тип топлива: АИ-92; Цена топлива: 47.6; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 5,
        i1: 5,
        i2: 5,
        t1: 1678102981,
        t2: 1678102981,
        d: 0,
        uid: 25965074,
        c: [
          "1.6",
          "ГАЗель в539ко 750(r)",
          "2023-03-06 14:43:01",
          "Идентификатор транзакции:6754132400;Номер карты:7826010104903964;Дата и время заправки:2023-03-06T14:43:01;Сумма заправки:1428;Количество топлива:30; Тип топлива: АИ-92; Цена топлива: 47.6; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 6,
        i1: 6,
        i2: 6,
        t1: 1678196368,
        t2: 1678196368,
        d: 0,
        uid: 25965074,
        c: [
          "1.7",
          "ГАЗель в539ко 750(r)",
          "2023-03-07 16:39:28",
          "Идентификатор транзакции:6777296780;Номер карты:7826010104903964;Дата и время заправки:2023-03-07T16:39:28;Сумма заправки:1713.6;Количество топлива:36; Тип топлива: АИ-92; Цена топлива: 47.6; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 7,
        i1: 7,
        i2: 7,
        t1: 1678341902,
        t2: 1678341902,
        d: 0,
        uid: 25965074,
        c: [
          "1.8",
          "ГАЗель в539ко 750(r)",
          "2023-03-09 09:05:02",
          "Идентификатор транзакции:6800554310;Номер карты:7826010104903964;Дата и время заправки:2023-03-09T09:05:02;Сумма заправки:1713.6;Количество топлива:36; Тип топлива: АИ-92; Цена топлива: 47.6; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 8,
        i1: 8,
        i2: 8,
        t1: 1678452674,
        t2: 1678452674,
        d: 0,
        uid: 25965074,
        c: [
          "1.9",
          "ГАЗель в539ко 750(r)",
          "2023-03-10 15:51:14",
          "Идентификатор транзакции:6830283330;Номер карты:7826010104903964;Дата и время заправки:2023-03-10T15:51:14;Сумма заправки:1428;Количество топлива:30; Тип топлива: АИ-92; Цена топлива: 47.6; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      }
    ]
  },
  {
    n: 1,
    i1: 0,
    i2: 12,
    t1: 1677681324,
    t2: 1678964797,
    d: 12,
    uid: 25965070,
    c: ["2", "ГАЗель к111хв 750(r)", "2023-03-01 17:35:24", "", "", "12"],
    r: [
      {
        n: 0,
        i1: 0,
        i2: 0,
        t1: 1677681324,
        t2: 1677681324,
        d: 0,
        uid: 25965070,
        c: [
          "2.1",
          "ГАЗель к111хв 750(r)",
          "2023-03-01 17:35:24",
          "Идентификатор транзакции:6665374830;Номер карты:7826010108737772;Дата и время заправки:2023-03-01T17:35:24;Сумма заправки:2176.67;Количество топлива:48.05; Тип топлива: АИ-92; Цена топлива: 45.3; Точка обслуживания: AZS101677;Адрес точки обслуживания:Россия, Калужская область, Боровский район, М3, 96 км, слева, г. Балабаново, ш. Киевское; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 1,
        i1: 1,
        i2: 1,
        t1: 1677749788,
        t2: 1677749788,
        d: 0,
        uid: 25965070,
        c: [
          "2.2",
          "ГАЗель к111хв 750(r)",
          "2023-03-02 12:36:28",
          "Идентификатор транзакции:6680787340;Номер карты:7826010108737772;Дата и время заправки:2023-03-02T12:36:28;Сумма заправки:1836.92;Количество топлива:40.55; Тип топлива: АИ-92; Цена топлива: 45.3; Точка обслуживания: AZS101677;Адрес точки обслуживания:Россия, Калужская область, Боровский район, М3, 96 км, слева, г. Балабаново, ш. Киевское; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 2,
        i1: 2,
        i2: 2,
        t1: 1677843053,
        t2: 1677843053,
        d: 0,
        uid: 25965070,
        c: [
          "2.3",
          "ГАЗель к111хв 750(r)",
          "2023-03-03 14:30:53",
          "Идентификатор транзакции:6704344910;Номер карты:7826010108737772;Дата и время заправки:2023-03-03T14:30:53;Сумма заправки:1812;Количество топлива:40; Тип топлива: АИ-92; Цена топлива: 45.3; Точка обслуживания: AZS101677;Адрес точки обслуживания:Россия, Калужская область, Боровский район, М3, 96 км, слева, г. Балабаново, ш. Киевское; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 3,
        i1: 3,
        i2: 3,
        t1: 1678041100,
        t2: 1678041100,
        d: 0,
        uid: 25965070,
        c: [
          "2.4",
          "ГАЗель к111хв 750(r)",
          "2023-03-05 21:31:40",
          "Идентификатор транзакции:6738756240;Номер карты:7826010108737772;Дата и время заправки:2023-03-05T21:31:40;Сумма заправки:1886.75;Количество топлива:41.65; Тип топлива: АИ-92; Цена топлива: 45.3; Точка обслуживания: AZS101677;Адрес точки обслуживания:Россия, Калужская область, Боровский район, М3, 96 км, слева, г. Балабаново, ш. Киевское; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 4,
        i1: 4,
        i2: 4,
        t1: 1678187460,
        t2: 1678187460,
        d: 0,
        uid: 25965070,
        c: [
          "2.5",
          "ГАЗель к111хв 750(r)",
          "2023-03-07 14:11:00",
          "Идентификатор транзакции:6774494610;Номер карты:7826010108737772;Дата и время заправки:2023-03-07T14:11:00;Сумма заправки:1404.3;Количество топлива:31; Тип топлива: АИ-92; Цена топлива: 45.3; Точка обслуживания: AZS101677;Адрес точки обслуживания:Россия, Калужская область, Боровский район, М3, 96 км, слева, г. Балабаново, ш. Киевское; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 5,
        i1: 5,
        i2: 5,
        t1: 1678278245,
        t2: 1678278245,
        d: 0,
        uid: 25965070,
        c: [
          "2.6",
          "ГАЗель к111хв 750(r)",
          "2023-03-08 15:24:05",
          "Идентификатор транзакции:6790047320;Номер карты:7826010108737772;Дата и время заправки:2023-03-08T15:24:05;Сумма заправки:1848.24;Количество топлива:40.8; Тип топлива: АИ-92; Цена топлива: 45.3; Точка обслуживания: AZS101677;Адрес точки обслуживания:Россия, Калужская область, Боровский район, М3, 96 км, слева, г. Балабаново, ш. Киевское; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 6,
        i1: 6,
        i2: 6,
        t1: 1678361126,
        t2: 1678361126,
        d: 0,
        uid: 25965070,
        c: [
          "2.7",
          "ГАЗель к111хв 750(r)",
          "2023-03-09 14:25:26",
          "Идентификатор транзакции:6807320890;Номер карты:7826010108737772;Дата и время заправки:2023-03-09T14:25:26;Сумма заправки:1848;Количество топлива:40; Тип топлива: АИ-92; Цена топлива: 46.2; Точка обслуживания: AZS101489;Адрес точки обслуживания:Россия, Московская область, Наро-Фоминский район, А108, 425 км, слева, д. Назарьево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 7,
        i1: 7,
        i2: 7,
        t1: 1678461019,
        t2: 1678461019,
        d: 0,
        uid: 25965070,
        c: [
          "2.8",
          "ГАЗель к111хв 750(r)",
          "2023-03-10 18:10:19",
          "Идентификатор транзакции:6832849730;Номер карты:7826010108737772;Дата и время заправки:2023-03-10T18:10:19;Сумма заправки:1940.4;Количество топлива:42; Тип топлива: АИ-92; Цена топлива: 46.2; Точка обслуживания: AZS101489;Адрес точки обслуживания:Россия, Московская область, Наро-Фоминский район, А108, 425 км, слева, д. Назарьево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 8,
        i1: 8,
        i2: 8,
        t1: 1678566852,
        t2: 1678566852,
        d: 0,
        uid: 25965070,
        c: [
          "2.9",
          "ГАЗель к111хв 750(r)",
          "2023-03-11 23:34:12",
          "Идентификатор транзакции:6849823880;Номер карты:7826010108737772;Дата и время заправки:2023-03-11T23:34:12;Сумма заправки:1734.99;Количество топлива:38.3; Тип топлива: АИ-92; Цена топлива: 45.3; Точка обслуживания: AZS101677;Адрес точки обслуживания:Россия, Калужская область, Боровский район, М3, 96 км, слева, г. Балабаново, ш. Киевское; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 9,
        i1: 9,
        i2: 9,
        t1: 1678726007,
        t2: 1678726007,
        d: 0,
        uid: 25965070,
        c: [
          "2.10",
          "ГАЗель к111хв 750(r)",
          "2023-03-13 19:46:47",
          "Идентификатор транзакции:6879741590;Номер карты:7826010108737772;Дата и время заправки:2023-03-13T19:46:47;Сумма заправки:2588.9;Количество топлива:57.15; Тип топлива: АИ-92; Цена топлива: 45.3; Точка обслуживания: AZS101677;Адрес точки обслуживания:Россия, Калужская область, Боровский район, М3, 96 км, слева, г. Балабаново, ш. Киевское; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 10,
        i1: 10,
        i2: 10,
        t1: 1678812612,
        t2: 1678812612,
        d: 0,
        uid: 25965070,
        c: [
          "2.11",
          "ГАЗель к111хв 750(r)",
          "2023-03-14 19:50:12",
          "Идентификатор транзакции:6900932080;Номер карты:7826010108737772;Дата и время заправки:2023-03-14T19:50:12;Сумма заправки:1644.39;Количество топлива:36.3; Тип топлива: АИ-92; Цена топлива: 45.3; Точка обслуживания: AZS101677;Адрес точки обслуживания:Россия, Калужская область, Боровский район, М3, 96 км, слева, г. Балабаново, ш. Киевское; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 11,
        i1: 12,
        i2: 12,
        t1: 1678964797,
        t2: 1678964797,
        d: 0,
        uid: 25965070,
        c: [
          "2.12",
          "ГАЗель к111хв 750(r)",
          "2023-03-16 14:06:37",
          "Идентификатор транзакции:6937154350;Номер карты:7826010108737772;Дата и время заправки:2023-03-16T14:06:37;Сумма заправки:1438.28;Количество топлива:31.75; Тип топлива: АИ-92; Цена топлива: 45.3; Точка обслуживания: AZS101677;Адрес точки обслуживания:Россия, Калужская область, Боровский район, М3, 96 км, слева, г. Балабаново, ш. Киевское; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      }
    ]
  },
  {
    n: 2,
    i1: 7,
    i2: 8,
    t1: 1678743347,
    t2: 1678977605,
    d: 2,
    uid: 25965067,
    c: ["3", "ГАЗель о796на 190(r)", "2023-03-14 00:35:47", "", "", "2"],
    r: [
      {
        n: 0,
        i1: 7,
        i2: 7,
        t1: 1678743347,
        t2: 1678743347,
        d: 0,
        uid: 25965067,
        c: [
          "3.1",
          "ГАЗель о796на 190(r)",
          "2023-03-14 00:35:47",
          "Идентификатор транзакции:6882083000;Номер карты:7826010104903774;Дата и время заправки:2023-03-14T00:35:47;Сумма заправки:2294.24;Количество топлива:48.71; Тип топлива: АИ-92; Цена топлива: 47.1; Точка обслуживания: AZS101356;Адрес точки обслуживания:Россия, Московская область, Рузский район, А108, справа, д. Нестерово; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 1,
        i1: 8,
        i2: 8,
        t1: 1678977605,
        t2: 1678977605,
        d: 0,
        uid: 25965067,
        c: [
          "3.2",
          "ГАЗель о796на 190(r)",
          "2023-03-16 17:40:05",
          "Идентификатор транзакции:6941234960;Номер карты:7826010104903774;Дата и время заправки:2023-03-16T17:40:05;Сумма заправки:1884;Количество топлива:40; Тип топлива: АИ-92; Цена топлива: 47.1; Точка обслуживания: AZS101361;Адрес точки обслуживания:Россия, Московская область, Рузский район, г. Руза, ул. Федеративная, 43; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      }
    ]
  },
  {
    n: 3,
    i1: 0,
    i2: 3,
    t1: 1678569862,
    t2: 1678778504,
    d: 4,
    uid: 25965065,
    c: ["4", "КамАЗ а971тс 750(r)", "2023-03-12 00:24:22", "", "", "4"],
    r: [
      {
        n: 0,
        i1: 0,
        i2: 0,
        t1: 1678569862,
        t2: 1678569862,
        d: 0,
        uid: 25965065,
        c: [
          "4.1",
          "КамАЗ а971тс 750(r)",
          "2023-03-12 00:24:22",
          "Идентификатор транзакции:6850057210;Номер карты:7826010108737806;Дата и время заправки:2023-03-12T00:24:22;Сумма заправки:8999.77;Количество топлива:154.37; Тип топлива: ДТ-Фирм; Цена топлива: 58.3; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 1,
        i1: 1,
        i2: 1,
        t1: 1678570206,
        t2: 1678570206,
        d: 0,
        uid: 25965065,
        c: [
          "4.2",
          "КамАЗ а971тс 750(r)",
          "2023-03-12 00:30:06",
          "Идентификатор транзакции:6850075700;Номер карты:7826010108737806;Дата и время заправки:2023-03-12T00:30:06;Сумма заправки:5209.11;Количество топлива:89.35; Тип топлива: ДТ-Фирм; Цена топлива: 58.3; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 2,
        i1: 2,
        i2: 2,
        t1: 1678778223,
        t2: 1678778223,
        d: 0,
        uid: 25965065,
        c: [
          "4.3",
          "КамАЗ а971тс 750(r)",
          "2023-03-14 10:17:03",
          "Идентификатор транзакции:6890163540;Номер карты:7826010108737806;Дата и время заправки:2023-03-14T10:17:03;Сумма заправки:8999.77;Количество топлива:154.37; Тип топлива: ДТ-Фирм; Цена топлива: 58.3; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 3,
        i1: 3,
        i2: 3,
        t1: 1678778504,
        t2: 1678778504,
        d: 0,
        uid: 25965065,
        c: [
          "4.4",
          "КамАЗ а971тс 750(r)",
          "2023-03-14 10:21:44",
          "Идентификатор транзакции:6890269270;Номер карты:7826010108737806;Дата и время заправки:2023-03-14T10:21:44;Сумма заправки:3956.82;Количество топлива:67.87; Тип топлива: ДТ-Фирм; Цена топлива: 58.3; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      }
    ]
  },
  {
    n: 4,
    i1: 0,
    i2: 6,
    t1: 1677646806,
    t2: 1678944286,
    d: 7,
    uid: 25965058,
    c: ["5", "КамАЗ х665ео 797(r)", "2023-03-01 08:00:06", "", "", "7"],
    r: [
      {
        n: 0,
        i1: 0,
        i2: 0,
        t1: 1677646806,
        t2: 1677646806,
        d: 0,
        uid: 25965058,
        c: [
          "5.1",
          "КамАЗ х665ео 797(r)",
          "2023-03-01 08:00:06",
          "Идентификатор транзакции:6652408050;Номер карты:7826010104903766;Дата и время заправки:2023-03-01T08:00:06;Сумма заправки:8999.77;Количество топлива:154.37; Тип топлива: ДТ-Фирм; Цена топлива: 58.3; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 1,
        i1: 1,
        i2: 1,
        t1: 1677647116,
        t2: 1677647116,
        d: 0,
        uid: 25965058,
        c: [
          "5.2",
          "КамАЗ х665ео 797(r)",
          "2023-03-01 08:05:16",
          "Идентификатор транзакции:6652545310;Номер карты:7826010104903766;Дата и время заправки:2023-03-01T08:05:16;Сумма заправки:1749;Количество топлива:30; Тип топлива: ДТ-Фирм; Цена топлива: 58.3; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 2,
        i1: 2,
        i2: 2,
        t1: 1677789740,
        t2: 1677789740,
        d: 0,
        uid: 25965058,
        c: [
          "5.3",
          "КамАЗ х665ео 797(r)",
          "2023-03-02 23:42:20",
          "Идентификатор транзакции:6690717270;Номер карты:7826010104903766;Дата и время заправки:2023-03-02T23:42:20;Сумма заправки:10944;Количество топлива:190; Тип топлива: ДТ; Цена топлива: 57.6; Точка обслуживания: AZS101495;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, с. Каринское, ш. Каринское, 114; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 3,
        i1: 3,
        i2: 3,
        t1: 1678454863,
        t2: 1678454863,
        d: 0,
        uid: 25965058,
        c: [
          "5.4",
          "КамАЗ х665ео 797(r)",
          "2023-03-10 16:27:43",
          "Идентификатор транзакции:6830995310;Номер карты:7826010104903766;Дата и время заправки:2023-03-10T16:27:43;Сумма заправки:9990.18;Количество топлива:173.14; Тип топлива: ДТ; Цена топлива: 57.7; Точка обслуживания: AZS101358;Адрес точки обслуживания:Россия, Московская область, Истринский район, ш. Волоколамское, 79 км, справа, п. Румянцево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 4,
        i1: 4,
        i2: 4,
        t1: 1678596871,
        t2: 1678596871,
        d: 0,
        uid: 25965058,
        c: [
          "5.5",
          "КамАЗ х665ео 797(r)",
          "2023-03-12 07:54:31",
          "Идентификатор транзакции:6852139270;Номер карты:7826010104903766;Дата и время заправки:2023-03-12T07:54:31;Сумма заправки:7345.8;Количество топлива:126; Тип топлива: ДТ-Фирм; Цена топлива: 58.3; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 5,
        i1: 5,
        i2: 5,
        t1: 1678778073,
        t2: 1678778073,
        d: 0,
        uid: 25965058,
        c: [
          "5.6",
          "КамАЗ х665ео 797(r)",
          "2023-03-14 10:14:33",
          "Идентификатор транзакции:6890104580;Номер карты:7826010104903766;Дата и время заправки:2023-03-14T10:14:33;Сумма заправки:8974.12;Количество топлива:153.93; Тип топлива: ДТ-Фирм; Цена топлива: 58.3; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      },
      {
        n: 6,
        i1: 6,
        i2: 6,
        t1: 1678944286,
        t2: 1678944286,
        d: 0,
        uid: 25965058,
        c: [
          "5.7",
          "КамАЗ х665ео 797(r)",
          "2023-03-16 08:24:46",
          "Идентификатор транзакции:6929613290;Номер карты:7826010104903766;Дата и время заправки:2023-03-16T08:24:46;Сумма заправки:8628.4;Количество топлива:148; Тип топлива: ДТ-Фирм; Цена топлива: 58.3; Точка обслуживания: AZS101263;Адрес точки обслуживания:Россия, Московская область, Одинцовский район, А107, 281 км, справа, д. Супонево; Координаты точки обслуживания:отсутствует;aggregator_id:8dd1cd3e-f6aa-4b6e-a8ee-8b9d4668b50b;Название агрератора:Роснефть",
          "Заправка",
          "1"
        ]
      }
    ]
  }
];
